Revit 2027 API
HostedSweep.RemoveSegment Method
Remove segments from the hosted sweep object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveSegment(
	Reference targetRef
)
Public Sub RemoveSegment (
	targetRef As Reference
)
public:
void RemoveSegment(
	Reference^ targetRef
)
member RemoveSegment :
        targetRef : Reference -> unit
Parameters
targetRef Reference
Segment's reference which want to be removed.
Exceptions
Exception | Condition
InvalidOperationException | Thrown when regeneration fails.
See Also
Reference
HostedSweep Class
Autodesk.Revit.DB Namespace